app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "This is a micropost."], ["user_id", 101], ["created_at", "2019-04-24 15:55:41.487889"], ["updated_at", "2019-04-24 15:55:41.487889"], ["picture", "avatar.jpg"]]

  def destroy
    @micropost.destroy
---
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 301]]

  def correct_user
    @micropost = current_user.microposts.find_by(id: params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["user_id", 101], ["id", 301], ["LIMIT", 1]]