app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$kLaXxsJatx/f6BsKrETBBeyaANz6NNvaIqpLsiKy1gsxAkYVMERF6"], ["updated_at", "2019-04-22 15:26:04.568500"], ["id", 104]]
---
  def update
    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jetonthaci@outlook.com"], ["LIMIT", 1]]
---
  def get_user
    @user = User.find_by(email: params[:email])